#include <iostream>
#include <stdio.h>
#pragma warning(disable : 4996)
struct mon {
	char name[15]; /* название */
	char sc;       /* группа */
	int cnt;       /* место обитания */
	float sq;      /* численность */
} mm[10];
int main()
{
	setlocale(LC_ALL, "Russian");
	struct mon x; /* рабочая переменная */
	int n;    /* количество элементов в массиве */
	int i, j; /* текущие индексы в массиве */
	int m;    /* индекс минимального элемента */
	float sqx;/* рабочая переменная */
	for (n = 0; n < 4; n++) {
		printf("%d. Введите: название, школу, количество, площадь >",
			n + 1);
		scanf_s("%s", mm[n].name, sizeof(mm[n].name));
		if (!strcmp(mm[n].name, "***")) break;
		scanf_s("%s", &mm[n].sc, sizeof(mm[n].name));
		scanf_s("%d", &mm[n].cnt);
		/* Внимание! Мы обходим ошибку в системе программирования */
		scanf_s("%f", &mm[n].sq); //mm[n].sq = sqx;
	}
	printf("-----------------------------------------------\n");
	printf("|         Некоторые виды антилоп              |\n");
	printf("|---------------------------------------------|\n");
	printf("| Название | Группа |   Место  | Численность  |\n");
	printf("|          |        | обитания |  популяции   |\n");
	printf("|----------|--------|----------|--------------|\n");
	for (i = 0; i < n; i++)
	{
		printf("|%-10s|%-8c|%-10s|%-14d|\n",
			mm[i].name, mm[i].sc, mm[i].cnt, mm[i].sq);
	}
	printf("---------------------------------------------\n");
	printf("|---------------------------------------------|\n");
	printf("|       Группы: А - настоящие антилопы,       |\n");
	printf("| B - коровьи антилопы, H - лошадиные антилопы|\n");
	printf("-----------------------------------------------\n");
	return 0;
}