// Lab1_6_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    int numberOfYears = 10000;
    int sec_in_day = 24 * 60 * 60;
    int sec_in_cur_year = sec_in_day * 365;
    int sec_in_number_years = sec_in_cur_year * numberOfYears + sec_in_day * (numberOfYears / 4);
    int sec_in_100_years = sec_in_cur_year * 100 + 25 * sec_in_day;
    int sec_in_1000_years = sec_in_100_years * 10 + 250 * sec_in_day;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
